Repository: andreicolegio-lgtm/libratrack-client
Catalog: lib/l10n/app_*.arb
Languages: es

# loginTitle
source: Welcome to LibraTrack
es: Bienvenido a LibraTrack

# loginSubtitle
source: Sign in to continue
es: Inicia sesión para continuar

# loginButton
source: Sign In
es: Iniciar Sesión

# loginPasswordLabel
source: Password
es: Contraseña

# loginOr
source: OR
es: O

# loginGoogle
source: Continue with Google
es: Continuar con Google

# loginRegisterPrompt
source: Don't have an account? Register
es: ¿No tienes cuenta? Regístrate

# registerTitle
source: Register
es: Registrarse

# registerUsernameLabel
source: Username
es: Nombre de Usuario

# registerLoginPrompt
source: Already have an account? Sign In
es: ¿Ya tienes cuenta? Inicia sesión

# bottomNavCatalog
source: Catalog
es: Catálogo

# bottomNavSearch
source: Search
es: Buscar

# bottomNavProfile
source: Profile
es: Perfil

# catalogTitle
source: My Catalog
es: Mi Catálogo

# catalogInProgress
source: In Progress
es: En Progreso

# catalogPending
source: Pending
es: Pendiente

# catalogFinished
source: Finished
es: Terminado

# catalogDropped
source: Dropped
es: Abandonado

# catalogEmptyState
source: No items found in state: {estado}
es: No hay elementos en estado: {estado}

# searchExploreType
source: Explore by Type
es: Explorar por Tipo

# searchExploreGenre
source: Explore by Genre
es: Explorar por Género

# searchFieldHint
source: Search by title...
es: Buscar por título...

# searchEmptyState
source: No elements were found with the applied filter.
es: No se encontraron elementos con el filtro aplicado.

# searchProposeButton
source: Propose Element
es: Proponer Elemento

# profileUserData
source: User Data
es: Datos de Usuario

# profileSaveButton
source: Save Changes
es: Guardar Cambios

# profileChangePassword
source: Change Password
es: Cambiar Contraseña

# profileCurrentPassword
source: Current Password
es: Contraseña actual

# profileNewPassword
source: New Password
es: Nueva contraseña

# profileModPanelButton
source: Moderation Panel
es: Panel de Moderación

# profileAdminPanelButton
source: Admin Panel
es: Panel de Administrador

# profileLogoutButton
source: Log Out
es: Cerrar Sesión

# settingsTitle
source: Settings
es: Ajustes

# settingsDarkMode
source: Dark Mode
es: Modo Oscuro

# settingsDarkModeOn
source: Enabled
es: Activado

# settingsDarkModeOff
source: Disabled
es: Desactivado

# settingsLanguage
source: Language
es: Idioma

# settingsLanguageSpanish
source: Spanish
es: Español

# settingsLanguageEnglish
source: English
es: Inglés

# settingsSystemDefault
source: System (Default)
es: Sistema (Por defecto)

# validationUsernameRequired
source: Username is required.
es: El nombre de usuario es obligatorio.

# validationUsernameLength450
source: Username must be between 4 and 50 characters.
es: El nombre de usuario debe tener entre 4 y 50 caracteres.

# validationEmailRequired
source: Email is required.
es: El email es obligatorio.

# validationEmailInvalid
source: Please enter a valid email.
es: Introduce un email válido.

# validationPasswordRequired
source: Password is required.
es: La contraseña es obligatoria.

# validationPasswordCurrentRequired
source: Current password is required.
es: La contraseña actual es obligatoria.

# validationPasswordNewRequired
source: New password is required.
es: La nueva contraseña es obligatoria.

# validationPasswordMin8
source: New password must be at least 8 characters.
es: La nueva contraseña debe tener al menos 8 caracteres.

# validationElementIdRequired
source: Element ID cannot be null.
es: El ID del elemento no puede ser nulo.

# validationRatingRequired
source: Rating is required.
es: La valoración es obligatoria.

# validationRatingMin1
source: Rating must be at least 1.
es: La valoración mínima es 1.

# validationRatingMax5
source: Rating must be 5 or less.
es: La valoración máxima es 5.

# validationReviewMax2000
source: Review cannot exceed 2000 characters.
es: La reseña no puede exceder los 2000 caracteres.

# validationTitleRequired
source: Title is required.
es: El título es obligatorio.

# validationDescRequired
source: Description is required.
es: La descripción es obligatoria.

# validationTypeRequired
source: Type is required.
es: El tipo es obligatorio.

# validationGenresRequired
source: Genres are required.
es: Los géneros son obligatorios.

# validationGoogleTokenRequired
source: Google token cannot be empty.
es: El token de Google no puede estar vacío.

# validationModStatusRequired
source: Moderator status must be specified.
es: Debe especificar el estado de moderador.

# validationAdminStatusRequired
source: Admin status must be specified.
es: Debe especificar el estado de administrador.

# errorEmailAlreadyRegistered
source: Email is already registered.
es: El email ya está registrado.

# errorUsernameAlreadyExists
source: Username already exists.
es: El nombre de usuario ya existe.

# errorPasswordIncorrect
source: Incorrect password.
es: La contraseña actual es incorrecta.

# errorAlreadyReviewed
source: You have already reviewed this item.
es: Ya has reseñado este elemento.

# errorInvalidRatingRange
source: Rating must be between 1 and 5.
es: La valoración debe estar entre 1 y 5.

# errorProposalAlreadyHandled
source: This proposal has already been handled.
es: Esta propuesta ya ha sido gestionada.

# errorTypeEmpty
source: Type cannot be empty.
es: El Tipo sugerido no puede estar vacío.

# errorGenresEmpty
source: Genres cannot be empty.
es: Los Géneros sugeridos no pueden estar vacíos.

# errorGenreInvalid
source: At least one valid genre must be provided.
es: Se debe proporcionar al menos un género válido.

# errorFileEmpty
source: File is empty.
es: El archivo está vacío.

# errorAlreadyInCatalog
source: This item is already in your catalog.
es: Este elemento ya está en tu catálogo.

# errorValidation
source: Validation error.
es: Error de validación.

# errorIllegalArgument
source: Illegal argument.
es: Argumento no válido.

# errorInternalServerError
source: An unexpected error occurred. Please try again later.
es: Ocurrió un error inesperado. Por favor, inténtalo de nuevo más tarde.

# errorAccessDenied
source: You do not have permission to access this resource.
es: No tienes permiso para acceder a este recurso.

# errorTokenExpired
source: Your session has expired. Please log in again.
es: Tu sesión ha caducado. Por favor, inicia sesión de nuevo.

# errorTokenInvalid
source: Invalid token. Please log in again.
es: Token inválido. Por favor, inicia sesión de nuevo.

# errorInvalidCredentials
source: Incorrect email or password.
es: Email o contraseña incorrectos.

# errorUnexpected
source: Unexpected error: {error}
es: Error inesperado: {error}

# errorLoadingFilters
source: Error loading filters: {error}
es: Error al cargar filtros: {error}

# errorLoadingElement
source: Error loading element: {error}
es: Error al cargar el elemento: {error}

# errorLoadingElements
source: Error loading elements: {error}
es: Error al cargar elementos: {error}

# errorLoadingReviews
source: Error loading reviews: {error}
es: Error al cargar las reseñas: {error}

# errorLoadingProposals
source: Error loading: {error}
es: Error al cargar: {error}

# errorImagePick
source: Error selecting image: {error}
es: Error al seleccionar imagen: {error}

# errorImageUpload
source: Error uploading image: {error}
es: Error al subir imagen: {error}

# errorSaving
source: Error saving: {error}
es: Error al guardar: {error}

# errorUpdating
source: Error updating: {error}
es: Error al actualizar: {error}

# errorApproving
source: Error approving: {error}
es: Error al aprobar: {error}

# errorUpdatingRoles
source: Error updating roles: {error}
es: Error al actualizar roles: {error}

# snackbarCloseButton
source: CLOSE
es: CERRAR

# snackbarLoginGoogleCancel
source: Sign in cancelled.
es: Inicio de sesión cancelado.

# snackbarRegisterSuccess
source: Registration successful! You are now logged in automatically.
es: ¡Registro exitoso! Ahora has iniciado sesión automáticamente.

# snackbarReviewPublished
source: Review published!
es: ¡Reseña publicada!

# snackbarReviewRatingRequired
source: Please select a rating (1-5 stars).
es: Por favor, selecciona una valoración (1-5 estrellas).

# snackbarProposalSent
source: Proposal sent successfully! Thank you for your contribution.
es: ¡Propuesta enviada con éxito! Gracias por tu contribución.

# snackbarProfilePhotoUpdated
source: Profile photo updated!
es: ¡Foto de perfil actualizada!

# snackbarProfileNoChanges
source: You haven't made any changes.
es: No has realizado ningún cambio.

# snackbarProfileUsernameUpdated
source: Username updated!
es: ¡Nombre de usuario actualizado!

# snackbarProfilePasswordUpdated
source: Password updated successfully!
es: ¡Contraseña actualizada con éxito!

# snackbarCatalogAdded
source: Added to catalog!
es: ¡Añadido al catálogo!

# snackbarCatalogRemoved
source: Removed from catalog
es: Elemento quitado del catálogo

# snackbarCatalogStatusUpdated
source: Status updated.
es: Estado actualizado.

# snackbarCatalogProgressSaved
source: Progress saved.
es: Progreso guardado.

# snackbarImageUploadSuccess
source: Image uploaded!
es: ¡Imagen subida!

# snackbarImageUploadRequired
source: Please upload a cover image.
es: Por favor, sube una imagen de portada.

# snackbarImageUploadRequiredApproval
source: Please upload a cover image before approving.
es: Por favor, sube una imagen de portada antes de aprobar.

# snackbarModProposalApproved
source: Proposal approved!
es: ¡Propuesta aprobada!

# snackbarModProposalRejected
source: Proposal rejected (simulated).
es: Propuesta rechazada (simulado).

# snackbarAdminRolesUpdated
source: Roles for {username} updated.
es: Roles de {username} actualizados.

# snackbarAdminElementUpdated
source: Element updated!
es: ¡Elemento actualizado!

# snackbarAdminElementCreated
source: OFFICIAL element created!
es: ¡Elemento OFICIAL creado!

# snackbarAdminStatusCommunity
source: Element marked as COMMUNITY.
es: Elemento marcado como COMUNITARIO.

# snackbarAdminStatusOfficial
source: Element marked as OFFICIAL!
es: ¡Elemento marcado como OFICIAL!

# reviewModalTitle
source: Write Review
es: Escribir Reseña

# reviewModalReviewLabel
source: Review (optional)
es: Reseña (opcional)

# reviewModalReviewHint
source: Write your opinion...
es: Escribe tu opinión...

# reviewModalSubmitButton
source: Publish Review
es: Publicar Reseña

# proposalFormTitle
source: Propose Element
es: Proponer Elemento

# proposalFormTitleLabel
source: Suggested Title
es: Título Sugerido

# proposalFormDescLabel
source: Brief Description
es: Descripción Breve

# proposalFormTypeLabel
source: Type (e.g. Series, Book, Anime)
es: Tipo (Ej. Serie, Libro, Anime)

# proposalFormGenresLabel
source: Genres (comma separated)
es: Géneros (separados por coma)

# proposalFormProgressTitle
source: Progress Data (Optional)
es: Datos de Progreso (Opcional)

# proposalFormSeriesEpisodesLabel
source: Episodes per Season
es: Episodios por Temporada

# proposalFormSeriesEpisodesHint
source: e.g. 10,8,12 (for S1, S2, S3)
es: Ej. 10,8,12 (para T1, T2, T3)

# proposalFormBookChaptersLabel
source: Total Chapters (Book)
es: Total Capítulos (Libro)

# proposalFormBookPagesLabel
source: Total Pages (Book)
es: Total Páginas (Libro)

# proposalFormAnimeEpisodesLabel
source: Total Episodes (Anime)
es: Total Episodios (Anime)

# proposalFormMangaChaptersLabel
source: Total Chapters (Manga)
es: Total Capítulos (Manga)

# proposalFormNoProgress
source: The type "{tipo}" does not require progress data.
es: El tipo "{tipo}" no requiere datos de progreso.

# proposalFormSubmitButton
source: Send Proposal
es: Enviar Propuesta

# elementDetailSynopsis
source: Synopsis
es: Sinopsis

# elementDetailProgressDetails
source: Progress Details
es: Detalles del Progreso

# elementDetailSeriesSeasons
source: Total Seasons
es: Total Temporadas

# elementDetailSeriesEpisodes
source: Episodes
es: Episodios

# elementDetailBookChapters
source: Total Chapters
es: Total Capítulos

# elementDetailBookPages
source: Total Pages
es: Total Páginas

# elementDetailAnimeEpisodes
source: Total Episodes
es: Total Episodios

# elementDetailMangaChapters
source: Total Chapters
es: Total Capítulos

# elementDetailPrequels
source: Prequels
es: Precuelas

# elementDetailSequels
source: Sequels
es: Secuelas

# elementDetailReviews
source: Reviews ({count})
es: Reseñas ({count})

# elementDetailAlreadyReviewed
source: Already reviewed
es: Ya has reseñado

# elementDetailWriteReview
source: Write Review
es: Escribir Reseña

# elementDetailNoReviews
source: There are no reviews for this item yet.
es: Aún no hay reseñas para este elemento.

# elementDetailAddButton
source: Add to My Catalog
es: Añadir a Mi Catálogo

# elementDetailAddingButton
source: Adding...
es: Añadiendo...

# elementDetailRemoveButton
source: Remove from catalog
es: Quitar del catálogo

# elementDetailRemovingButton
source: Removing...
es: Eliminando...

# elementDetailAdminEdit
source: Edit
es: Editar

# elementDetailAdminMakeCommunity
source: Make Community
es: Comunitarizar

# elementDetailAdminMakeOfficial
source: Make Official
es: Oficializar

# elementDetailNoElement
source: Element not found.
es: Elemento no encontrado.

# adminFormEditTitle
source: Edit Element
es: Editar Elemento

# adminFormCreateTitle
source: Create Official Element
es: Crear Elemento Oficial

# adminFormEditButton
source: Save Changes
es: Guardar Cambios

# adminFormCreateButton
source: Create Element
es: Crear Elemento

# adminFormImageTitle
source: Add cover
es: Añadir portada

# adminFormImageGallery
source: Gallery
es: Galería

# adminFormImageUpload
source: Upload
es: Subir

# adminFormImageUploading
source: Uploading...
es: Subiendo...

# adminFormTitleLabel
source: Title
es: Título

# adminFormDescLabel
source: Description
es: Descripción

# adminFormTypeLabel
source: Type (e.g. Series, Book)
es: Tipo (Ej. Serie, Libro)

# adminFormGenresLabel
source: Genres (comma separated)
es: Géneros (separados por coma)

# adminFormProgressTitle
source: Progress Data (Optional)
es: Datos de Progreso (Opcional)

# adminFormSequelsTitle
source: Sequels (Optional)
es: Secuelas (Opcional)

# adminFormSequelsSubtitle
source: Elements that come AFTER this one.
es: Elementos que van DESPUÉS de este.

# adminPanelSearchHint
source: Search by name or email...
es: Buscar por nombre o email...

# adminPanelFilterAll
source: All
es: Todos

# adminPanelFilterMods
source: Moderators
es: Moderadores

# adminPanelRoleMod
source: Moderator
es: Moderador

# adminPanelRoleAdmin
source: Administrator
es: Administrador

# adminPanelSaveButton
source: Save Changes
es: Guardar Cambios

# adminPanelCreateElement
source: Create Element
es: Crear Elemento

# adminPanelNoUsersFound
source: No users found.
es: No se encontraron usuarios.

# modPanelTitle
source: Moderation Panel
es: Panel de Moderación

# modPanelProposalFrom
source: Proposed by: {username}
es: Propuesto por: {username}

# modPanelProposalType
source: Type: {type}
es: Tipo: {type}

# modPanelProposalGenres
source: Genres: {genres}
es: Géneros: {genres}

# modPanelReject
source: Reject
es: Rechazar

# modPanelReview
source: Review
es: Revisar

# modPanelNoPending
source: Good job! No pending proposals.
es: ¡Buen trabajo! No hay propuestas pendientes.

# modPanelNoOthers
source: No {status} proposals.
es: No hay propuestas {status}.

# modPanelStatusPending
source: Pending
es: Pendientes

# modPanelStatusApproved
source: Approved
es: Aprobadas

# modPanelStatusRejected
source: Rejected
es: Rechazadas

# modEditTitle
source: Review Proposal
es: Revisar Propuesta

# modEditImageTitle
source: No cover
es: Sin portada

# modEditProgressTitle
source: Progress Data (Required!)
es: Datos de Progreso (¡Obligatorio!)

# modEditSeriesEpisodesRequired
source: This field is required for Series
es: Este campo es obligatorio para Series

# modEditBookChaptersRequired
source: This field is required for Books
es: Este campo es obligatorio para Libros

# modEditBookPagesRequired
source: This field is required for Books
es: Este campo es obligatorio para Libros

# modEditUnitRequired
source: This field is required
es: Este campo es obligatorio

# modEditSubmitButton
source: Save and Approve
es: Guardar y Aprobar

# catalogCardState
source: Status
es: Estado

# catalogCardSeriesSeason
source: S{season}
es: T{season}

# catalogCardBookChapter
source: Chapter
es: Capítulo

# catalogCardBookPage
source: Page
es: Página

# catalogCardSaveChanges
source: Save Progress
es: Guardar Progreso

# contentStatusOfficial
source: OFFICIAL
es: OFICIAL

# contentStatusCommunity
source: COMMUNITY
es: COMUNITARIO

# reviewCardBy
source: Review by: {username}
es: Reseña de: {username}

# reviewCardNoText
source: This user did not write a review.
es: Este usuario no ha escrito un texto.

# errorGoogleTokenInvalid
source: Invalid Google Token.
es: Token de Google inválido.

# errorGoogleTokenError
source: Error verifying Google Token.
es: Error al verificar el token de Google.

# errorRefreshTokenRequired
source: Refresh token is required.
es: Se requiere un token de refresco.

# errorRefreshTokenNotFound
source: Refresh token not found.
es: Token de refresco no encontrado.

# errorRefreshTokenExpired
source: Your session has expired. Please log in again.
es: Tu sesión ha caducado. Por favor, inicia sesión de nuevo.

# errorProposalNotFound
source: Proposal not found.
es: Propuesta no encontrada.

# errorNotInCatalog
source: This item is not in your catalog.
es: Este elemento no está en tu catálogo.

# validationSeasonMin1
source: Season must be at least 1.
es: La temporada debe ser al menos 1.

# validationUnitMin0
source: Unit must be at least 0.
es: La unidad debe ser al menos 0.

# validationChapterMin0
source: Chapter must be at least 0.
es: El capítulo debe ser al menos 0.

# validationPageMin0
source: Page must be at least 0.
es: La página debe ser al menos 0.

# validationTypeNameRequired
source: Type name is required.
es: El nombre del tipo es obligatorio.

# validationTypeNameMax50
source: Type name must be 50 characters or less.
es: El nombre del tipo debe tener 50 caracteres o menos.

# validationGenreNameRequired
source: Genre name is required.
es: El nombre del género es obligatorio.

# validationGenreNameMax50
source: Genre name must be 50 characters or less.
es: El nombre del género debe tener 50 caracteres o menos.

# validationTitleMax255
source: Title must be 255 characters or less.
es: El título debe tener 255 caracteres o menos.

# validationDescMax5000
source: Description must be 5000 characters or less.
es: La descripción debe tener 5000 caracteres o menos.

# validationEpisodesStringMax255
source: Episodes string is too long.
es: La cadena de episodios es demasiado larga.

# validationUnitsMin1
source: Total units must be at least 1.
es: El total de unidades debe ser al menos 1.

# validationChaptersMin1
source: Total chapters must be at least 1.
es: El total de capítulos debe ser al menos 1.

# validationPagesMin1
source: Total pages must be at least 1.
es: El total de páginas debe ser al menos 1.

# validationCommentMax500
source: Comment must be 500 characters or less.
es: El comentario debe tener 500 caracteres o menos.

# errorReviewerNotFound
source: Reviewer not found.
es: Revisor no encontrado.

# errorFileSave
source: Error saving file.
es: Error al guardar el archivo.

# errorUserNotFound
source: User not found.
es: Usuario no encontrado.

# passwordRulesTitle
source: Password Rules
es: Reglas de Contraseña

# passwordRulesContent
source: • Minimum 8 characters • At least 1 uppercase letter • At least 1 lowercase letter • At least 1 number • At least 1 special character (@$!%*?&)
es: • Mínimo 8 caracteres • Al menos 1 mayúscula • Al menos 1 minúscula • Al menos 1 número • Al menos 1 carácter especial (@$!%*?&)

# dialogCloseButton
source: Close
es: Cerrar

# validationPasswordComplexity
source: Password must meet complexity requirements.
es: La contraseña debe cumplir con los requisitos de complejidad.

# validationPasswordUnchanged
source: You haven't made any changes.
es: No has realizado ningún cambio.

# registrationSuccessAutoLogin
source: Registration successful! You are now logged in automatically.
es: ¡Registro exitoso! Ahora has iniciado sesión automáticamente.

# validationPasswordRules
source: The password must be at least 8 characters long, including an uppercase letter, a lowercase letter, a number, and a special character.
es: La contraseña debe tener al menos 8 caracteres, incluyendo una letra mayúscula, una letra minúscula, un número y un carácter especial.

# typeMovie
source: Movie
es: Película

# typeVideoGame
source: Video Game
es: Videojuego

# typeBook
source: Book
es: Libro

# typeSeries
source: Series
es: Serie

# genreAction
source: Action
es: Acción

# genreAdventure
source: Adventure
es: Aventura

# genreComedy
source: Comedy
es: Comedia

# genreFantasy
source: Fantasy
es: Fantasía

# genreHorror
source: Horror
es: Terror

# genreMystery
source: Mystery
es: Misterio

# genreSciFi
source: Sci-Fi
es: Ciencia Ficción

# genreSliceOfLife
source: Slice of Life
es: Recuentos de la vida

# genrePsychological
source: Psychological
es: Psicológico

# genreHistorical
source: Historical
es: Histórico

# genreCrime
source: Crime
es: Crimen

# genreFamily
source: Family
es: Familia

# genreWar
source: War
es: Guerra

# genrePostApocalyptic
source: Post-Apocalyptic
es: Post-apocalíptico

# genreMartialArts
source: Martial Arts
es: Artes Marciales

# genreSchool
source: School
es: Escolar

# genrePlatformer
source: Platformer
es: Plataformas

# genreStrategy
source: Strategy
es: Estrategia

# genreFighting
source: Fighting
es: Lucha

# genreSports
source: Sports
es: Deportes

# genreRacing
source: Racing
es: Carreras

# genreOpenWorld
source: Open World
es: Mundo Abierto

# genreSimulator
source: Simulator
es: Simulador

# genreSurvivalHorror
source: Survival Horror
es: Terror de supervivencia

# genreBiography
source: Biography
es: Biografía

# genreEssay
source: Essay
es: Ensayo

# genrePoetry
source: Poetry
es: Poesía

# genreSelfHelp
source: Self-Help
es: Autoayuda

# genreBusiness
source: Business
es: Negocios

# genreNoir
source: Noir
es: Novela Negra

# genreMagicalRealism
source: Magical Realism
es: Realismo Mágico
